# 元组:一旦定义完成 无法修改
# 1. 元组字面量
# (元素, 元素, ......, 元素)

# 2. 定义元组变量
# 变量名 = (元素, 元素, ......, 元素)

# 3. 空元组两种定义方式
# 方式1：空小括号
t1 = ()
# 方式2：tuple()函数
t2 = tuple()

# 定义元组
t1 = (1,"hello",True)
t2 = ()
t3 = tuple()
print(f"t1的类型是:{type(t1)},内容是:{t1}")
print(f"t2的类型是:{type(t2)},内容是:{t2}")
print(f"t3的类型是:{type(t3)},内容是:{t3}")

# 定义单个元素的元素
t4 = ("hello",)  # 单个元素需要在单元素后面➕个，
print(f"t4的类型是:{type(t4)},t4的内容是：{t4}")

# 元组的嵌套
t5 = ((1,2,3),(4,5,6))
print(f"t5的类型是{type(t5)},内容是:{t5}")

# 下标索引去取出内容
num = t5[1][2]
print(f"从嵌套元组取出的数据是：{num}")

# ┌────┬─────────────┬─────────────────────────────────────────────┐
# │编号│     方法     │ 作用                                        │
# ├────┼─────────────┼─────────────────────────────────────────────┤
# │ 1  │ index()     │ 查找某个数据，存在返回下标，不存在程序报错   │
# │ 2  │ count()     │ 统计目标数据在元组里出现的次数              │
# │ 3  │ len(元组)   │ 统计元组所有元素的总个数                    │
# └────┴─────────────┴─────────────────────────────────────────────┘

# 元组的操作，index查找方法
t6 = ("传智教育","黑马程序员","python")
index = t6.index("黑马程序员")
print(f"在元组t6中查找黑马程序员，的下标是：{index}")

# 元组的操作：count统计方法

t7 = ("传智教育","黑马程序员","黑马程序员","黑马程序员","黑马程序员","python")
num = t7.count("黑马程序员")
print(f"在元组t7中统计黑马程序员的数量有:{num}个")

# 元组的操作:len函数统计元组元素数量
t8 = ("传智教育","黑马程序员","黑马程序员","黑马程序员","黑马程序员","python")
num =len(t8)
print(f"t8元组中的元素有:{num}个")

# 元组的遍历: while
index = 0
while index < len(t8):
    print(f"元组的元素有:{t8[index]}")
    # 至关重要
    index += 1

# 元组的遍历：for
for element in t8:
    print(f"2之间的元素有:{element}")

# 修改元组内容
# t8[0] = "itcast"

# 定义一个元组
t9 = (1,2,['itheima',"itcast"])
print(f"t9的内容是:{t9}")
t9[2][0] = "黑马程序员"
t9[2][1] = "传智教育"
print(f"t9的内容是:{t9}")

# ===================== 元组特点总结 =====================
# 1. 可存放多个元素
# 2. 支持不同数据类型混合存放
# 3. 有序排列，支持下标索引取值
# 4. 允许存在重复数据
# 5. 核心特性：整体不可修改，无法新增、删除、更改元素
# 6. 支持使用for循环遍历
#
# 补充：元组大部分特性和列表list一致，唯一关键区别：元组不可修改

