# ====================== 字典的定义 注释整理 ======================
# 字典使用大括号{}包裹，内部存放的是一组组【键值对 key: value】
# 语法格式：{key: value, key: value, …… , key: value}

# 1. 定义有数据的字典变量
# my_dict = {key: value, key: value, …… , key: value}

# 2. 两种定义空字典的写法
# my_dict = {}        # 空字典写法1，最常用
# my_dict = dict()    # 空字典写法2，使用dict()函数创建

# 补充区分：
# {} 是空字典，不是空集合；空集合必须写 set()

# 定义字典
my_dict1 = {"王力宏": 99 , "周杰伦": 88 , "林俊杰": 77}
my_dict2 = {}       # 空集合set()
my_dict3 = dict()
print(f"字典1的内容是: {my_dict1},类型是：{type(my_dict1)}")
print(f"字典2的内容是: {my_dict2},类型是：{type(my_dict2)}")
print(f"字典3的内容是: {my_dict3},类型是：{type(my_dict3)}")

# 定义重复key的字典
my_dict1 = {"王力宏": 99 , "王力宏": 88 , "林俊杰": 77}
print(f"重复key的字典的内容是：{my_dict1}")

# 从字典中基于key来获取value
my_dict1 = {"王力宏": 99 , "周杰伦": 88 , "林俊杰": 77}
score = my_dict1["王力宏"]
print(f"王力宏的考试分数是：{score}")

# 字典的嵌套
# 1. 字典键值数据类型规则
# 字典的key（键）、value（值）支持绝大多数数据类型，但有硬性限制：key绝对不能是字典
# value没有限制，可以是字典、列表、数字、字符串等所有类型
# 2. 因为value可以存放字典，因此字典支持嵌套写法（字典里面包含字典）
# 3. 本次需求：利用字典嵌套，记录多名学生的各科考试分数信息

# 定义嵌套字典
stu_score_dict = {
    "王力宏":{
        "语文":77,
        "数学":66,
        "英语":33
    },"周杰伦":{
        "语文": 88,
        "数学": 66,
        "英语": 55
    },"林俊杰":{
        "语文": 99,
        "数学": 96,
        "英语": 66
    }
}
print(f"学生的考试信息是:{stu_score_dict}")

# 从嵌套字典中获取数据
# 看一下周杰伦的语文信息
score = stu_score_dict["周杰伦"]["语文"]
print(f"周杰伦的语文分数是：:{score}")
score = stu_score_dict["林俊杰"]["英语"]
print(f"林俊杰的英语成绩是:{score}")


