# ASCII码表知识点
# 1. 程序里字符串包含的三类字符都有专属ASCII数字码值：
#    ① 大小写英文字母
#    ② 数字 0~9
#    ③ 特殊符号：!、\、|、@、#、空格等各类符号
# 2. 规则：每一个字符一一对应一个数字码值
# 3. 字符串大小比较底层逻辑：按照字符对应的ASCII码数字大小依次比较

# 常用ASCII关键区间（方便记忆）
# 空格：32
# 数字0-9：ASCII 48 ~ 57
# 大写字母A-Z：ASCII 65 ~ 90
# 小写字母a-z：ASCII 97 ~ 122

# Python获取字符ASCII值：ord("字符")
# 根据数字转回字符：chr(ASCII数字)
# 示例
# print(ord("A"))  # 65
# print(chr(97))   # a

# ASCII完整对照简表
# ASCII值 字符 | ASCII值 字符 | ASCII值 字符 | ASCII值 字符
# 0 NUT       32 空格        64 @         96 `
# 1 SOH       33 !          65 A         97 a
# 2 STX       34 "          66 B         98 b
# 3 ETX       35 #          67 C         99 c
# 4 EOT       36 $          68 D        100 d
# 5 ENQ       37 %          69 E        101 e
# 6 ACK       38 &          70 F        102 f
# 7 BEL       39 '          71 G        103 g
# 8 BS        40 (          72 H        104 h
# 9 HT        41 )          73 I        105 i
# 10 LF       42 *          74 J        106 j
# 11 VT       43 +          75 K        107 k
# 12 FF       44 ,          76 L        108 l
# 13 CR       45 -          77 M        109 m
# 14 SO       46 .          78 N        110 n
# 15 SI       47 /          79 O        111 o
# 16 DLE      48 0          80 P        112 p
# 17 DC1      49 1          81 Q        113 q
# 18 DC2      50 2          82 R        114 r
# 19 DC3      51 3          83 S        115 s
# 20 DC4      52 4          84 T        116 t
# 21 NAK      53 5          85 U        117 u
# 22 SYN      54 6          86 V        118 v
# 23 TB       55 7          87 W        119 w
# 24 CAN      56 8          88 X        120 x
# 25 EM       57 9          89 Y        121 y
# 26 SUB      58 :          90 Z        122 z
# 27 ESC      59 ;          91 [        123 {
# 28 FS       60 <          92 \        124 |
# 29 GS       61 =          93 ]        125 }
# 30 RS       62 >          94 ^        126 ~
# 31 US       63 ?          95 _        127 DEL

# abc 比较 abd
print(f"abd大于abc,结果：{'abd' > 'abc'}")

# a 比较 ab
print(f"ab大于a，结果:{'ab' > 'a'}")

# a 比较 A
print(f"a 大于 A，结果：{'a' > 'A'}")

# key1 比较 key2
print(f"key2 > key1,结果：{'key2' > 'key1'}")

# 字符串比较规则
# 1、字符串整体比较方式：
# 从头到尾逐个字符依次对比，只要某一位字符分出大小，后续字符不再比较
# 2、单个字符大小判断依据：
# 根据ASCII码表，使用字符对应的数字码值判断大小，码值数字越大字符越大