# 坚持表白100天，，每天都送10朵花
# range
i = 0
for i in range(1,101):
    print(f"今天是向小美表白的第{i}天，加油坚持。")

    #写内层的循环
    for j in range(1,11):
        print(f"给小美送的第{j}朵玫瑰花")

    print("小美，我喜欢你")

print(f"第{i}天，表白成功！")

# for循环和while循环是可以相互嵌套的
# ===================== for循环、while循环嵌套语法总结 =====================
# 语法通用格式：
# 外层 for循环 或 while循环:
#     循环满足条件应做的事情1
#     循环满足条件应做的事情2
#     循环满足条件应做的事情N
#     ……
#     内层 for循环 或 while循环:
#         循环满足条件应做的事情1
#         循环满足条件应做的事情2
#         循环满足条件应做的事情N

# ===================== 注意事项 =====================
# 1. Python依靠缩进区分层级，嵌套for循环必须依靠缩进确定代码层次归属，缩进错误逻辑出错
# 2. for循环和while循环可以互相嵌套使用（for套while / while套for都合法）
